app/Controllers/DashboardController.php

    public function index()
    {
        $user = session()->get('user');

        if (!$user) {
            return redirect()->to('/login');
        }

        $patientModel     = new PatientModel();
        $doctorModel      = new DoctorModel();
        $appointmentModel = new AppointmentModel();
        $admissionModel   = new AdmissionModel();
        $medicineModel    = new MedicineModel();
        $invoiceModel     = new InvoiceModel();

        $totalPatients     = $patientModel->countAll();
        $totalDoctors      = $doctorModel->countAll();
        $totalAppointments = $appointmentModel->countAll();
        $todayAppointments = $appointmentModel
            ->where('DATE(scheduled_at)', date('Y-m-d'))
            ->countAllResults();
        $activeAdmissions  = $admissionModel
            ->where('status', 'admitted')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `patients`
SELECT COUNT(*) AS `numrows` FROM `doctors`
SELECT COUNT(*) AS `numrows` FROM `appointments`
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE DATE(scheduled_at) = '2025-11-21'
SELECT COUNT(*) AS `numrows`
FROM `admissions`
WHERE `status` = 'admitted'