app/Controllers/LoginController.php

    public function login()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        if (!$email || !$password) {
            session()->setFlashdata('error', 'Email and password are required');
            return redirect()->back();
        }

        $user = $this->userModel->verifyCredentials($email, $password);

        if ($user && $user['status'] === 'active') {
            // Update last login
            $this->userModel->update($user['id'], ['last_login' => date('Y-m-d H:i:s')]);
---
UPDATE `users` SET `last_login` = '2025-11-21 04:39:11', `updated_at` = '2025-11-21 04:39:11'
WHERE `users`.`id` IN ('1')