app/Models/InvoiceModel.php

SELECT *
FROM `invoices`
WHERE `status` IN ('unpaid','partially_paid')
---
    public function getUnpaidInvoices()
    {
        return $this->whereIn('status', ['unpaid', 'partially_paid'])->findAll();