app/Models/MedicineModel.php

SELECT *
FROM `medicines`
WHERE stock_quantity <= min_stock_threshold
---
    public function getLowStockMedicines()
    {
        return $this->where('stock_quantity <=', 'min_stock_threshold', false)->findAll();

SELECT *
FROM `medicines`
WHERE `expiry_date` <= '2025-12-21'
---
    public function getExpiringMedicines($days = 30)
    {
        $date = date('Y-m-d', strtotime("+{$days} days"));
        return $this->where('expiry_date <=', $date)->findAll();